
[
  { "code": "CS 12300", "title": "Programming I: Java", "description": "Introduction to the fundamental concepts of programming and problem solving using the Java programming language." },
  { "code": "CS 12400", "title": "Programming II: Object-Oriented Java", "description": "A continuation of CS 12300 which focuses on object-oriented programming along with the fundamentals of object-oriented design." },
  { "code": "CS 27500", "title": "Data Structures", "description": "Data structures describe the way that computer programs organize and store information. Topics include linked lists, arrays, stacks, queues, trees, graphs." },
  { "code": "CS 30200", "title": "Operating Systems", "description": "An operating system manages all of the hardware and software resources of a computer. Topics include multiprogramming, CPU scheduling, memory management." },
  { "code": "CS 33200", "title": "Algorithms", "description": "An algorithm is a procedure for solving a problem in a finite number of steps. Topics include sorting, searching, probabilistic, graph, and geometric algorithms." },
  { "code": "CS 33600", "title": "Network Programming", "description": "Introduction to computer networks and the programming of network applications using the Sockets API." },
  { "code": "CS 46200", "title": "Introduction To Artificial Intelligence", "description": "Fundamental concepts and techniques of AI. Topics include intelligent agents, search algorithms, machine learning." },
  { "code": "CS 46900", "title": "Machine Learning And Data Mining", "description": "Introduction of data mining and machine learning. Neural Networks, decision trees, and Deep Learning applications." },
  { "code": "ITS 15000", "title": "Introduction To Cybersecurity", "description": "Foundational concepts, principles, and tools of cybersecurity. Vulnerabilities, threats, data security, and risk management." },
  { "code": "ITS 26000", "title": "Applied Database Technologies", "description": "Database query languages, information management concepts, data modeling, and SQL." },
  { "code": "ITS 34000", "title": "Advanced Programming", "description": "In-depth discussions of data structures, algorithms, memory management, and concurrent programming." },
  { "code": "ITS 36500", "title": "Machine Learning Foundations", "description": "Introduction to the machine learning and deep learning pipeline and concepts." },
  { "code": "ITS 44000", "title": "Mobile Application Development", "description": "Developing mobile applications for multiple platforms (smartphones and tablets)." },
  { "code": "BIA 30800", "title": "Database Management Analysis And Design", "description": "Functions and components of database management systems. Relational and object oriented database techniques." },
  { "code": "BIA 32000", "title": "Spreadsheet Modeling And Decision Analytics", "description": "Prepare students to analyze data and solve real-life business problems using Microsoft Excel." },
  { "code": "BIA 43000", "title": "Data Preparation And Visualization", "description": "Data visualization best practices, live and interactive dashboard development, and data storytelling." },
  { "code": "BIA 46600", "title": "Practical Computing For Data Analytics", "description": "Introduction to computing tools (e.g. R, Python) and their uses as data analytics tools." },
  { "code": "ECET 36200", "title": "Process Control Instrumentation", "description": "Reviews process control principles and practices. Analog and digital signal conditioning." },
  { "code": "ECET 45500", "title": "Object Oriented System Design", "description": "Designing Graphic User Interface (GUI) applications using Object Oriented Programming (OOP)." },
  { "code": "MET 34700", "title": "Intro To Robotics", "description": "Introduction to industrial robotics, programming, and automation." },
  { "code": "BUSM 10100", "title": "Introduction To Business", "description": "An introduction to the internal operations and external environment of contemporary business." },
  { "code": "BUSM 41100", "title": "Entrepreneurship And Creative Managerial Thinking", "description": "Provides students with a solid foundation in terms of the vital role played by entrepreneurs." },
  { "code": "MGMT 62000", "title": "Marketing Management", "description": "An integrated analysis of major marketing decisions, including product pricing, advertising, and distribution." },
  { "code": "MKG 42000", "title": "Paid Digital Marketing Strategy", "description": "Provides an opportunity for students to work on a digital marketing campaign for a real-world client." },
  { "code": "COM 11400", "title": "Fundamentals Of Speech Communication", "description": "A study of communication theories as applied to speech; practical communicative experiences." },
  { "code": "ENGL 22000", "title": "Technical Report Writing", "description": "Application of the principles of good writing in industrial reporting." },
  { "code": "STAT 30100", "title": "Elementary Statistical Methods", "description": "Introduction to statistical methods with applications to diverse fields. Data analysis, sampling, probability." },
  { "code": "CGT 11800", "title": "Fundamentals Of Imaging Technology", "description": "Foundation for the development and use of raster and vector images." },
  { "code": "CGT 25600", "title": "Principles Of User Experience Design", "description": "Introduces students to the process of user-centered design of computer systems humans interact with." },
  { "code": "CIS 24100", "title": "Foundations Of Web Design And Development", "description": "Introduction to Web design. HTML, CSS, and web programming languages." },
  { "code": "CIS 34100", "title": "Advanced Web Design And Development", "description": "Server side web development technologies. PHP and MySQL." },
  { "code": "CIS 46300", "title": "Introduction To Mobile Programming", "description": "Introduction to programming applications for mobile devices. Android app development." },
  { "code": "CS 12100", "title": "Introduction To Python With Applications In AI", "description": "Hands-on introduction to Python programming with a focus on AI applications." },
  { "code": "ECE 27001", "title": "Introduction to Digital System Design", "description": "Introduction to the analysis and design of combinational and sequential digital systems." }
]
